In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A': 'foo bar foo bar foo bar foo foo'.split(),
                   'B': 'one one two three two two one three'.split(),
                   'C': np.arange(8), 'D': np.arange(8) * 2})
print(df)
#      A      B  C   D
# 0  foo    one  0   0
# 1  bar    one  1   2
# 2  foo    two  2   4
# 3  bar  three  3   6
# 4  foo    two  4   8
# 5  bar    two  5  10
# 6  foo    one  6  12
# 7  foo  three  7  14

#print(df.loc[df['A'] == 'foo'])

     A      B  C   D
0  foo    one  0   0
1  bar    one  1   2
2  foo    two  2   4
3  bar  three  3   6
4  foo    two  4   8
5  bar    two  5  10
6  foo    one  6  12
7  foo  three  7  14

In [21]:
dept = pd.DataFrame({'B':['one', 'two', 'three'], 'NAME':['부서1', '부서2', '부서3']})

In [22]:
dept

       B NAME
0    one  부서1
1    two  부서2
2  three  부서3

In [23]:
pd.merge(df, dept, on='B', how='outer')

     A      B  C   D NAME
0  foo    one  0   0  부서1
1  bar    one  1   2  부서1
2  foo    one  6  12  부서1
3  foo    two  2   4  부서2
4  foo    two  4   8  부서2
5  bar    two  5  10  부서2
6  bar  three  3   6  부서3
7  foo  three  7  14  부서3

In [24]:
pd.concat([df, dept], axis=1, join='inner')

     A    B  C  D      B NAME
0  foo  one  0  0    one  부서1
1  bar  one  1  2    two  부서2
2  foo  two  2  4  three  부서3

In [19]:
pd.concat([df, dept], axis=1, join='outer')

     A      B  C   D      B NAME
0  foo    one  0   0    one  부서1
1  bar    one  1   2    tow  부서2
2  foo    two  2   4  three  부서3
3  bar  three  3   6    NaN  NaN
4  foo    two  4   8    NaN  NaN
5  bar    two  5  10    NaN  NaN
6  foo    one  6  12    NaN  NaN
7  foo  three  7  14    NaN  NaN

In [1]:
ns = [1, 2, 3, 4, 5]
result = []
for n in ns:
    if n % 2 == 1:
        result.append(n*2)

In [2]:
result

[2, 6, 10]

In [5]:
r2 = [n*2 for n in ns if n % 2 == 1]

In [36]:
r2

[2, 6, 10]

In [6]:
input("File path:")

File name:C:\Temp\NsmData

'C:\\Temp\\NsmData'

In [10]:
df_save = pd.DataFrame()

In [17]:
col_a = { 'COL1' : list()}
col_a['COL1'].append(1)
col_a['COL1'].append(2)
col_a['COL1'].append('3')
print(col_a)

{'COL1': [1, 2, '3']}

In [11]:
# Create a Pandas Excel writer using XlsxWriter as the engine.
writer = pd.ExcelWriter('pandas_simple.xlsx', engine='xlsxwriter')

# Convert the dataframe to an XlsxWriter Excel object.
df_save.to_excel(writer, sheet_name='Sheet1')

# Close the Pandas Excel writer and output the Excel file.
writer.save()

In [7]:
d = 'ICUBE/GW 클라우드서버'
a = 1 if 'ICUBE' in d elif 'IU' in d elif 'GW' in d else 0
a

SyntaxError: invalid syntax (<ipython-input-7-05042f68b910>, line 2)